{"publish":{"publish_pages_app":true,"publish_sha":"","publish_iso_date":""},"users":[],"project":{"github_org":"Alyssaf-j","title":"NWAV Conference Project","description":"“Type Shit”: Discursive borrowing, Black diasporic relationality and musical rendering across Franco/Anglophone contexts\nThe Black Atlanta discourse marker ‘type shit’ has become a location of innovation and expressive relationality between Black people across the diaspora. In particular, through Atlanta trap music, the term ‘type shit’ has facilitated lyrical and everyday expressions of Black life. As a discourse marker, ‘type shit’ can occur alone or sentence-finally and it sometimes functions as a backchannel marker for signaling alignment. Aside from the spoken history of ‘type shit’ starting around 2021 (Yung LA 2023), Atlanta staples like the Migos, Future, and Playboi Carti have contributed musically to the frequency and a canon of the discourse. In this paper, I consider the performance speech of Cameroonian, Congolese-French rapper La Fève of ‘type shit’ in a similarly named song featuring Atlanta native Yung LA. In the album 24, La Fève pays reverence not only to Atlanta’s musical history of people and places but also to the formalized structure of trap music with help of Atlanta producer, Zaytoven. This multilingual process, between Black French and Black Atlanta English, demands a new way of analyzing language variation, which motivates the present work, whose aims are threefold:\n1) Analyze the history between France/French and the Black south and the ways in which the diaspora continues to influence each other’s culture, language, and sound;\n2) Analyze the various realizations of the discourse marker ‘type shit’ in song in French and English (syntactically, morphologically, phonetically) and the work of discursive borrowing, language accommodation, language mixing and code-switching;\n3) Analyze language variation through an epistemology of Black sound and music tradition, the geography of the trap, and the similarly-named genre of trap music (Rose 1994; Richardson 2006; Alim et al. 2008).\nThe work is informed by studies on African American Language (AAL), such as “African American Voices in Atlanta” (Lanehart 2021), and works of scholars on Black Francophone identity (in the Caribbean and Africa) amidst a white French universalism (Glissant 1990; Walsh 2014; Smith 2015). Black Franco-Anglophone contexts existing between the US and France has historically included the Black south– whether it be Louisiana’s French/English history, a history of Black people taking French names, or even African American expatriates in France post WWI who deeply inspired the French Avant-Garde movement (Archer-Straw 2000). Amidst these contexts, Black diasporans have represented their experiences with an expressive lineage from the arts to everyday language practice. In this case, I focus on the language variation in the song “TYPE SHIT”, between artists La Fève and Yung LA, and the project 24 as a whole. Ultimately, this project seeks to archive Black southern language as an undeniable, originary influence on African American language (AAL), musical and cultural traditions, and relationality for the global African diaspora. ","language":"en","slug":"type-shit","creator":"Alyssaf-j","authors":"","media_player":"avannotate","auto_populate_home_page":true,"additional_users":[],"tags":{"tagGroups":[{"category":"Sound","color":"#ADFFD9"},{"category":"Speaker","color":"#ADFEFF"},{"category":"_uncategorized_","color":"#A3A3A3"}],"tags":[{"category":"Sound","tag":"Black epistemologies of sound"},{"category":"Speaker","tag":"Yung L.A."},{"category":"_uncategorized_","tag":"\"type shit\""},{"category":"_uncategorized_","tag":"Discourse on the trap"},{"category":"_uncategorized_","tag":"Morphosyntax"},{"category":"_uncategorized_","tag":"Phonology"},{"category":"_uncategorized_","tag":"Adlibs"},{"category":"_uncategorized_","tag":"Storytelling"},{"category":"_uncategorized_","tag":"La Fève"}]},"created_at":"2024-10-11T22:02:04.886Z","updated_at":"2024-10-18T05:47:16.654Z"}}